---
kind: method
id: M:Autodesk.Revit.DB.OrdinateDimensionSetting.#ctor
source: html/ecce71c6-11d6-3d55-ab4c-d0b731b3322d.htm
---
# Autodesk.Revit.DB.OrdinateDimensionSetting.#ctor Method

Constructs a new OrdinateDimensionSetting object with default settings.

## Syntax (C#)
```csharp
public OrdinateDimensionSetting()
```